{
    "home": {
        "heading": "Hey, I'm Olivier 👋",
        "subheading": { 
            "part1": "I am a front-end web developer",
            "part2": "Send me a message!"
        },
        "buttons": {
            "contact": "Contact",
            "download": "Download CV"
        }
    },
    "about": {
        "heading": "About",
        "aboutMe": {
            "heading": "About Me",
            "part1": "I have been passionate about software development for many years now. My interests shifted from game development to systems programming and, finally, into web development.",
            "part2": "When I am not sitting in front of a computer, I like to watch hockey and MMA."
        },
        "education": {
            "heading": "Education",
            "part1": "In 2018, I moved to Toronto to study Computer Programming & Analysis at Seneca College.",
            "part2": "I attended multiple hackathons during my college years and met plenty of interesting future software developers. These events inspired me to keep learning beyond the standard curriculum and pursue side-projects that I can be proud of."
        },
        "caption": "Attending the first NSBEHacks at the University of Toronto, 2018."
    },
    "projects": {
        "heading": "Projects",
        "privanote": {
            "heading": "PrivaNote",
            "description": {
                "part1": "PrivaNote is a secure note-taking desktop application that runs on macOS and Windows. It allows users to take notes in Markdown to enable quick and beautiful note-taking on the fly.",
                "part2": "Notes can synchronize with cloud storage such as Google Drive or PrivaNote Vault. If the user chooses PrivaNote Vault, they will have the ability to synchronize their notes privately and securely using E2E encryption."
            },
            "caption": "Editing a note in PrivaNote.",
            "technologies": {
                "react": "React was used as the primary front-end library for composing the user interface. It allowed for dynamic and reactive components to be displayed in the view.",
                "electron": "The team chose electron to create a cross-platform desktop application using web technologies.",
                "prisma": "We needed an ORM to interface with our Postgresql database. We selected Prisma because it works amazingly well with TypeScript.",
                "tailwindcss": "We used TailwindCSS to style our application. It is quick and easy to whip up some nice styles in TailwindCSS. They also offer nice defaults for themeing.",
                "typescript": "TypeScript was a must-have for the project. It offers type-safety and type inference which speeds up our development time and prevents certain bugs from occurring.",
                "webpack": "We created our own webpack configuration."
            }
        }
    },
    "timeline": {
        "heading": "Timeline",
        "events": {
            "seneca-college": { 
                "title": "Seneca College",
                "description1": "In September of 2018, I began my studies in Computer Programming & Analysis at Seneca College in Toronto, ON. It was a three year program where we learned about web development, database, cloud computing, game development, and systems programming.", 
                "description2": "",
                "date": "Sep 2018"
            },
            "nsbehacks": {
                "title": "NSBEHacks 2018",
                "description1": "My friends and I attended the NSBEHacks hackathon at the University of Toronto. It was our first hackathon and we had learned so much from the experience and had good fun.",
                "description2": "",
                "date": "Nov 2018"
            },
            "hack-the-valley": {
                "title": "Hack the Valley III & IV",
                "description1": "Hack the Valley III was where I found my passion for web development. It is where I first learned React and we used it to create a simple front-end to an e-commerce site.",
                "description2": "The next year I attended Hack the Valley IV where I paired up with an electrical engineering student. We worked on an application where you could track items on a map with the use of BLE beacons akin to AirTags or Tile devices.",
                "date": "Feb 2019 and Feb 2020"
            },
            "privanote": {
                "title": "PrivaNote",
                "description1": "As mentioned above, PrivaNote was our note-taking application which was composed by React, Electron, and other technologies. This application was my greatest project during the entirety of my studies. From inception to deployment we have learned so much.",
                "description2": "",
                "date": "Apr 2021 - Dec 2021"
            },
            "graduation": {
                "title": "Graduation",
                "description1": "Earned my advanced diploma in Computer Programming & Analysis at Seneca College.",
                "description2": "P.S. In case you're looking for me in this picture, I am not there. I graduated during COVID-19 and sadly didn't get a graduation ceremony.",
                "date": "Dec 2021"
            },
            "eclipse-foundation": {
                "title": "Eclipse Foundation",
                "description1": "Working as a front-end web developer at the Eclipse Foundation. It is my first official role in the industry!",
                "description2": "",
                "date": "Jul 2022 - Current"
            }
        }
    },
    "contact": {
        "heading": "Contact",
        "subheading": "Feel free to send me a message through the site or social media!",
        "options": {
            "message": "Message",
            "or": "or",
            "discord": "My Discord username is zxcv#6382."
        },
        "form": {
            "email": "Email",
            "name": "Name",
            "subject": "Subject",
            "message": "Message",
            "send": "Send"
        }
    },
    "navigationBar": {
        "links": {
            "home": "Home",
            "about": "About",
            "projects": "Projects",
            "resume": "Resume",
            "experiences": "Experiences",
            "contact": "Contact"
        }
    }
}